app/Controllers/ClientesController.php

    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->findAll();
---
SELECT *
FROM `clientes`

    public function buscarClientes($cliente_id =null)
    {
        $clientes = new ClientesModel();
        $datos['datos']=$clientes->where('cliente_id',$cliente_id)->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '0'
 LIMIT 1