app/Controllers/LineasTelefonicasController.php

SELECT *
FROM `lineas_telefonicas`
---
    public function index(): string
    {
        $lineas = new LineasTelefonicasModel();
        $datos['datos']=$lineas->findALL();

INSERT INTO `lineas_telefonicas` (`no_telefono`, `fecha_pago`, `meses_atraso`, `plan_id`, `cliente_id`) VALUES ('63', '', '', '5', '1500')
---
    public function agregarLinea()
    {
        $no_telefono = $this->request->getVar('txtNoTelefono');
        //echo "<br>Id = ". $id;
        $fecha_pago=$this->request->getVar('txtFecha');
        //echo "<br>nombre = ". $nombre;
        $meses = $this->request->getVar('txtMeses');
        //echo "<br>Pago =". $pago;
        $plan_id = $this->request->getVar('txtIdPlan');
        //echo "<br>Minutos = ". $minutos;
        $cliente_id = $this->request->getvar('txtIdCliente');
        //echo "<br>Mensajes = ". $mensajes;

        $lineas = new LineasTelefonicasModel();
        $datos = [
            'no_telefono' => $no_telefono,
            'fecha_pago' =>$fecha_pago,
            'meses_atraso' => $meses,
            'plan_id' => $plan_id,
            'cliente_id' => $cliente_id,
        ];
        $lineas->insert($datos);