app/Controllers/PlanesController.php

SELECT *
FROM `planes`
---
    public function index(): string
    {
        $planes = new PlanesModel(); //crear objeto
        $datos['datos']=$planes->findAll(); //Select * from planes; es un array

SELECT *
FROM `planes`
WHERE `plan_id` = '1'
 LIMIT 1
---
    public function buscarPlan($id=null){
      //  echo "codigo".$id;
      $planes = new PlanesModel();
      //select * from planes where plan_id = $id;
      $datos['datos']=$planes->where('plan_id', $id)->first();

INSERT INTO `planes` (`plan_id`, `nombre`, `pago_mensual`, `cantidad_minutos`, `cantidad_mensajes`) VALUES ('6', 'vendedores', '200', '500', '100')
---
    public function agregarPlan()
    {
        $planid = $this->request->getVar('txtPlanId');
        //echo "<br>Id = ". $id;
        $nombre=$this->request->getVar('txtNombre');
        //echo "<br>nombre = ". $nombre;
        $pagomensual= $this->request->getVar('txtPagoMensual');
        //echo "<br>Pago =". $pago;
        $cantidadminutos= $this->request->getVar('txtCantidadMinutos');
        //echo "<br>Minutos = ". $minutos;
        $cantidadmensajes= $this->request->getvar('txtCantidadMensajes');
        //echo "<br>Mensajes = ". $mensajes;

        $planes = new PlanesModel();
        $datos = [
            'plan_id' => $planid,
            'nombre' =>$nombre,
            'pago_mensual' => $pagomensual,
            'cantidad_minutos' => $cantidadminutos,
            'cantidad_mensajes' => $cantidadmensajes,
        ];
        $planes->insert($datos);